app/controllers/api/v1/songs_controller.rb

  def create
    song = Song.create({
      title: params[:title],
      event: Event.find(params[:id])
    })

    verses = Verse.where(song: song)
---
INSERT INTO "songs" ("title", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "hi"], ["event_id", 1], ["created_at", "2017-12-29 02:00:30.879199"], ["updated_at", "2017-12-29 02:00:30.879199"]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "verses".* FROM "verses" WHERE "verses"."song_id" = 24

  def update
    song = Song.find(params[:id])
    song.update(title: params[:title])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "songs" SET "title" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["title", "First Songvd"], ["updated_at", "2018-01-03 03:39:13.348077"], ["id", 1]]