app/controllers/api/v1/verses_controller.rb

INSERT INTO "verses" ("song_id", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["song_id", 1], ["lyrics", "Fifth Verse"], ["created_at", "2018-01-04 04:40:10.686087"], ["updated_at", "2018-01-04 04:40:10.686087"]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    verse = Verse.create({
      lyrics: params[:lyrics],
      song: Song.find(params[:song_id]),
      code: detected_language(params[:lyrics])
    })