app/controllers/events_controller.rb

  def show
    @event = Event.find(params[:id])
    @songs = Song.where(event: @event)
    @verses = []
    @songs.each do |song|
      @verses << Verse.where(song: song).order(:id)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."event_id" = 1
SELECT "verses".* FROM "verses" WHERE "verses"."song_id" = 1 ORDER BY "verses"."id" ASC