app/controllers/songs_controller.rb

  def show
    @song = Song.find(params[:id])
    @verses = Verse.where(song: @song).order(:id)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "verses".* FROM "verses" WHERE "verses"."song_id" = 1 ORDER BY "verses"."id" ASC