app/controllers/verses_controller.rb

SELECT  "verses".* FROM "verses" WHERE "verses"."current" = $1 LIMIT $2  [["current", "t"], ["LIMIT", 1]]
---
  def index
    @lyrics = nil
    @current_event = nil
    @code = nil

    verse = Verse.find_by(current: true)