app/controllers/verses_controller.rb

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "verses".* FROM "verses" WHERE "verses"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."in_progress" = $1 LIMIT $2  [["in_progress", "t"], ["LIMIT", 1]]
---
  def index
    @lyrics = nil
    @current_event = nil
    @code = 'en'

    selected_song = Song.where("selected_verse_id > 0").last

    if selected_song
      verse = Verse.find(selected_song.selected_verse_id)
      @lyrics = verse.lyrics
      @code = verse.code
    end

    if Event.find_by(in_progress: true)